# 2. 企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
#  20万到40万之间时高于20万元的部分，可提成5%；40万到60万之间时高于40万元的部分，可提成3%；60万到100万之间时，高于60万元的部分，可提成1.5%
#  高于100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数
i=int(input("当月利润："))
y=[100000,200000,400000,600000,1000000]
t=0
if i<=y[0]:
    t=i*0.1
elif i<=y[1]:
    t=y[0]*0.1+(i-y[0])*0.075
elif i<=y[2]:
    t=y[0]*0.1+(y[1]-y[0])*0.075+(i-y[1])*0.05
elif i<=y[3]:
    t=y[0]*0.1+(y[1]-y[0])*0.075+(y[2]-y[1])*0.05+(i-y[2])*0.03
elif i<=y[4]:
    t=y[0]*0.1+(y[1]-y[0])*0.075+(y[2]-y[1])*0.05+(y[3]-y[2])*0.03+(i-y[3])*0.015
else:
    t=y[0]*0.1+(y[1]-y[0])*0.075+(y[2]-y[1])*0.05+(y[3]-y[2])*0.03+(y[4]-y[3])*0.015+(i-y[4])*0.01
print("发放的奖金总数",t)

#原答案(更优):
# i = int(input('净利润:'))
# arr = [1000000,600000,400000,200000,100000,0]
# rat = [0.01,0.015,0.03,0.05,0.075,0.1]
# r = 0
# for idx in range(0,6):
#     if i>arr[idx]:
#         r+=(i-arr[idx])*rat[idx]
#         i=arr[idx]
# print (r)
